{"class_name": "Model", "keras_version": "2.0.6", "config": {"name": "model_1", "output_layers": [["dense_8", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_4", "class_name": "InputLayer", "config": {"sparse": false, "name": "input_4", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": false, "data_format": "channels_last", "padding": [[3, 3], [3, 3]]}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [7, 7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "conv1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn_conv1", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn_conv1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "name": "activation_99", "class_name": "Activation", "config": {"name": "activation_99", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_99", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "pool_size": [3, 3], "padding": "valid", "trainable": false, "data_format": "channels_last"}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "res2a_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "res2a_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2a_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "name": "activation_100", "class_name": "Activation", "config": {"name": "activation_100", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_100", 0, 0, {}]]], "name": "res2a_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "res2a_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2a_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "name": "activation_101", "class_name": "Activation", "config": {"name": "activation_101", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_101", 0, 0, {}]]], "name": "res2a_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res2a_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "res2a_branch1", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res2a_branch1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2a_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2a_branch1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "name": "add_33", "class_name": "Add", "config": {"name": "add_33", "trainable": false}}, {"inbound_nodes": [[["add_33", 0, 0, {}]]], "name": "activation_102", "class_name": "Activation", "config": {"name": "activation_102", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_102", 0, 0, {}]]], "name": "res2b_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "res2b_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2b_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "name": "activation_103", "class_name": "Activation", "config": {"name": "activation_103", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_103", 0, 0, {}]]], "name": "res2b_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "res2b_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2b_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "name": "activation_104", "class_name": "Activation", "config": {"name": "activation_104", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_104", 0, 0, {}]]], "name": "res2b_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res2b_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2b_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_102", 0, 0, {}]]], "name": "add_34", "class_name": "Add", "config": {"name": "add_34", "trainable": false}}, {"inbound_nodes": [[["add_34", 0, 0, {}]]], "name": "activation_105", "class_name": "Activation", "config": {"name": "activation_105", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_105", 0, 0, {}]]], "name": "res2c_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "res2c_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2c_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "name": "activation_106", "class_name": "Activation", "config": {"name": "activation_106", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_106", 0, 0, {}]]], "name": "res2c_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "res2c_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2c_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "name": "activation_107", "class_name": "Activation", "config": {"name": "activation_107", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_107", 0, 0, {}]]], "name": "res2c_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res2c_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn2c_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_105", 0, 0, {}]]], "name": "add_35", "class_name": "Add", "config": {"name": "add_35", "trainable": false}}, {"inbound_nodes": [[["add_35", 0, 0, {}]]], "name": "activation_108", "class_name": "Activation", "config": {"name": "activation_108", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_108", 0, 0, {}]]], "name": "res3a_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "res3a_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3a_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "name": "activation_109", "class_name": "Activation", "config": {"name": "activation_109", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_109", 0, 0, {}]]], "name": "res3a_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "res3a_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3a_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "name": "activation_110", "class_name": "Activation", "config": {"name": "activation_110", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_110", 0, 0, {}]]], "name": "res3a_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "res3a_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["activation_108", 0, 0, {}]]], "name": "res3a_branch1", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "res3a_branch1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3a_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3a_branch1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "name": "add_36", "class_name": "Add", "config": {"name": "add_36", "trainable": false}}, {"inbound_nodes": [[["add_36", 0, 0, {}]]], "name": "activation_111", "class_name": "Activation", "config": {"name": "activation_111", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_111", 0, 0, {}]]], "name": "res3b_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "res3b_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3b_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "name": "activation_112", "class_name": "Activation", "config": {"name": "activation_112", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_112", 0, 0, {}]]], "name": "res3b_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "res3b_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3b_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "name": "activation_113", "class_name": "Activation", "config": {"name": "activation_113", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_113", 0, 0, {}]]], "name": "res3b_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "res3b_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "name": "bn3b_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3b_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_111", 0, 0, {}]]], "name": "add_37", "class_name": "Add", "config": {"name": "add_37", "trainable": false}}, {"inbound_nodes": [[["add_37", 0, 0, {}]]], "name": "activation_114", "class_name": "Activation", "config": {"name": "activation_114", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_114", 0, 0, {}]]], "name": "res3c_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "res3c_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "name": "bn3c_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3c_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "name": "activation_115", "class_name": "Activation", "config": {"name": "activation_115", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_115", 0, 0, {}]]], "name": "res3c_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "res3c_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "name": "bn3c_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3c_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "name": "activation_116", "class_name": "Activation", "config": {"name": "activation_116", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_116", 0, 0, {}]]], "name": "res3c_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "res3c_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "name": "bn3c_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3c_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_114", 0, 0, {}]]], "name": "add_38", "class_name": "Add", "config": {"name": "add_38", "trainable": false}}, {"inbound_nodes": [[["add_38", 0, 0, {}]]], "name": "activation_117", "class_name": "Activation", "config": {"name": "activation_117", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_117", 0, 0, {}]]], "name": "res3d_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "res3d_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3d_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "name": "activation_118", "class_name": "Activation", "config": {"name": "activation_118", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_118", 0, 0, {}]]], "name": "res3d_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "res3d_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3d_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "name": "activation_119", "class_name": "Activation", "config": {"name": "activation_119", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_119", 0, 0, {}]]], "name": "res3d_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "res3d_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "name": "bn3d_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn3d_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_117", 0, 0, {}]]], "name": "add_39", "class_name": "Add", "config": {"name": "add_39", "trainable": false}}, {"inbound_nodes": [[["add_39", 0, 0, {}]]], "name": "activation_120", "class_name": "Activation", "config": {"name": "activation_120", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_120", 0, 0, {}]]], "name": "res4a_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res4a_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "name": "bn4a_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4a_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "name": "activation_121", "class_name": "Activation", "config": {"name": "activation_121", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_121", 0, 0, {}]]], "name": "res4a_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res4a_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "name": "bn4a_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4a_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "name": "activation_122", "class_name": "Activation", "config": {"name": "activation_122", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_122", 0, 0, {}]]], "name": "res4a_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 1024, "name": "res4a_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["activation_120", 0, 0, {}]]], "name": "res4a_branch1", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 1024, "name": "res4a_branch1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [2, 2], "data_format": "channels_last"}}, {"inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "name": "bn4a_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4a_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "name": "bn4a_branch1", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4a_branch1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "name": "add_40", "class_name": "Add", "config": {"name": "add_40", "trainable": false}}, {"inbound_nodes": [[["add_40", 0, 0, {}]]], "name": "activation_123", "class_name": "Activation", "config": {"name": "activation_123", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_123", 0, 0, {}]]], "name": "res4b_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res4b_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "name": "bn4b_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4b_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "name": "activation_124", "class_name": "Activation", "config": {"name": "activation_124", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_124", 0, 0, {}]]], "name": "res4b_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res4b_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "name": "bn4b_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4b_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "name": "activation_125", "class_name": "Activation", "config": {"name": "activation_125", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_125", 0, 0, {}]]], "name": "res4b_branch2c", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 1024, "name": "res4b_branch2c", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "name": "bn4b_branch2c", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4b_branch2c", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_123", 0, 0, {}]]], "name": "add_41", "class_name": "Add", "config": {"name": "add_41", "trainable": false}}, {"inbound_nodes": [[["add_41", 0, 0, {}]]], "name": "activation_126", "class_name": "Activation", "config": {"name": "activation_126", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_126", 0, 0, {}]]], "name": "res4c_branch2a", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res4c_branch2a", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "name": "bn4c_branch2a", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4c_branch2a", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "name": "activation_127", "class_name": "Activation", "config": {"name": "activation_127", "trainable": false, "activation": "relu"}}, {"inbound_nodes": [[["activation_127", 0, 0, {}]]], "name": "res4c_branch2b", "class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "linear", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "res4c_branch2b", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "name": "bn4c_branch2b", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "epsilon": 0.001, "axis": 3, "name": "bn4c_branch2b", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "momentum": 0.99}}, {"inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "name": "activation_128", "class_name": "Activation",