{"backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Model", "config": {"layers": [{"name": "input_17", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_17", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "zero_padding2d_17", "config": {"data_format": "channels_last", "name": "zero_padding2d_17", "padding": [[3, 3], [3, 3]], "trainable": false}, "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "conv1", "config": {"name": "conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 64, "activation": "linear", "kernel_size": [7, 7], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"name": "bn_conv1", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn_conv1", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_785", "config": {"trainable": false, "name": "activation_785", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "max_pooling2d_17", "config": {"pool_size": [3, 3], "trainable": false, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_17", "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_785", 0, 0, {}]]]}, {"name": "res2a_branch2a", "config": {"name": "res2a_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 64, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2a_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_786", "config": {"trainable": false, "name": "activation_786", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "res2a_branch2b", "config": {"name": "res2a_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 64, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_786", 0, 0, {}]]]}, {"name": "bn2a_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2a_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "activation_787", "config": {"trainable": false, "name": "activation_787", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"name": "res2a_branch2c", "config": {"name": "res2a_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 256, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_787", 0, 0, {}]]]}, {"name": "res2a_branch1", "config": {"name": "res2a_branch1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 256, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2a_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "bn2a_branch1", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2a_branch1", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_257", "config": {"name": "add_257", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_788", "config": {"trainable": false, "name": "activation_788", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_257", 0, 0, {}]]]}, {"name": "res2b_branch2a", "config": {"name": "res2b_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 64, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_788", 0, 0, {}]]]}, {"name": "bn2b_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2b_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"name": "activation_789", "config": {"trainable": false, "name": "activation_789", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"name": "res2b_branch2b", "config": {"name": "res2b_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 64, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_789", 0, 0, {}]]]}, {"name": "bn2b_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2b_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"name": "activation_790", "config": {"trainable": false, "name": "activation_790", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"name": "res2b_branch2c", "config": {"name": "res2b_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 256, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_790", 0, 0, {}]]]}, {"name": "bn2b_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2b_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"name": "add_258", "config": {"name": "add_258", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_788", 0, 0, {}]]]}, {"name": "activation_791", "config": {"trainable": false, "name": "activation_791", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_258", 0, 0, {}]]]}, {"name": "res2c_branch2a", "config": {"name": "res2c_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 64, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_791", 0, 0, {}]]]}, {"name": "bn2c_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2c_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"name": "activation_792", "config": {"trainable": false, "name": "activation_792", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"name": "res2c_branch2b", "config": {"name": "res2c_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 64, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_792", 0, 0, {}]]]}, {"name": "bn2c_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2c_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"name": "activation_793", "config": {"trainable": false, "name": "activation_793", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"name": "res2c_branch2c", "config": {"name": "res2c_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 256, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_793", 0, 0, {}]]]}, {"name": "bn2c_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn2c_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"name": "add_259", "config": {"name": "add_259", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_791", 0, 0, {}]]]}, {"name": "activation_794", "config": {"trainable": false, "name": "activation_794", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_259", 0, 0, {}]]]}, {"name": "res3a_branch2a", "config": {"name": "res3a_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 128, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_794", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3a_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "activation_795", "config": {"trainable": false, "name": "activation_795", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2b", "config": {"name": "res3a_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 128, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_795", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3a_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "activation_796", "config": {"trainable": false, "name": "activation_796", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"name": "res3a_branch2c", "config": {"name": "res3a_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 512, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_796", 0, 0, {}]]]}, {"name": "res3a_branch1", "config": {"name": "res3a_branch1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 512, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_794", 0, 0, {}]]]}, {"name": "bn3a_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3a_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"name": "bn3a_branch1", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3a_branch1", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_260", "config": {"name": "add_260", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "activation_797", "config": {"trainable": false, "name": "activation_797", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_260", 0, 0, {}]]]}, {"name": "res3b_branch2a", "config": {"name": "res3b_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 128, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_797", 0, 0, {}]]]}, {"name": "bn3b_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3b_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"name": "activation_798", "config": {"trainable": false, "name": "activation_798", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"name": "res3b_branch2b", "config": {"name": "res3b_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 128, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_798", 0, 0, {}]]]}, {"name": "bn3b_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3b_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"name": "activation_799", "config": {"trainable": false, "name": "activation_799", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"name": "res3b_branch2c", "config": {"name": "res3b_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 512, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_799", 0, 0, {}]]]}, {"name": "bn3b_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3b_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"name": "add_261", "config": {"name": "add_261", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_797", 0, 0, {}]]]}, {"name": "activation_800", "config": {"trainable": false, "name": "activation_800", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_261", 0, 0, {}]]]}, {"name": "res3c_branch2a", "config": {"name": "res3c_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 128, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_800", 0, 0, {}]]]}, {"name": "bn3c_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3c_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"name": "activation_801", "config": {"trainable": false, "name": "activation_801", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"name": "res3c_branch2b", "config": {"name": "res3c_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 128, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_801", 0, 0, {}]]]}, {"name": "bn3c_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3c_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"name": "activation_802", "config": {"trainable": false, "name": "activation_802", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"name": "res3c_branch2c", "config": {"name": "res3c_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 512, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_802", 0, 0, {}]]]}, {"name": "bn3c_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3c_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"name": "add_262", "config": {"name": "add_262", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_800", 0, 0, {}]]]}, {"name": "activation_803", "config": {"trainable": false, "name": "activation_803", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_262", 0, 0, {}]]]}, {"name": "res3d_branch2a", "config": {"name": "res3d_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 128, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_803", 0, 0, {}]]]}, {"name": "bn3d_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3d_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"name": "activation_804", "config": {"trainable": false, "name": "activation_804", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"name": "res3d_branch2b", "config": {"name": "res3d_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 128, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_804", 0, 0, {}]]]}, {"name": "bn3d_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3d_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"name": "activation_805", "config": {"trainable": false, "name": "activation_805", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"name": "res3d_branch2c", "config": {"name": "res3d_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 512, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_805", 0, 0, {}]]]}, {"name": "bn3d_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn3d_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"name": "add_263", "config": {"name": "add_263", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_803", 0, 0, {}]]]}, {"name": "activation_806", "config": {"trainable": false, "name": "activation_806", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_263", 0, 0, {}]]]}, {"name": "res4a_branch2a", "config": {"name": "res4a_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 256, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_806", 0, 0, {}]]]}, {"name": "bn4a_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4a_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"name": "activation_807", "config": {"trainable": false, "name": "activation_807", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"name": "res4a_branch2b", "config": {"name": "res4a_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 256, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_807", 0, 0, {}]]]}, {"name": "bn4a_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4a_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"name": "activation_808", "config": {"trainable": false, "name": "activation_808", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"name": "res4a_branch2c", "config": {"name": "res4a_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 1024, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_808", 0, 0, {}]]]}, {"name": "res4a_branch1", "config": {"name": "res4a_branch1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 1024, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_806", 0, 0, {}]]]}, {"name": "bn4a_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4a_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"name": "bn4a_branch1", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4a_branch1", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"name": "add_264", "config": {"name": "add_264", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"name": "activation_809", "config": {"trainable": false, "name": "activation_809", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_264", 0, 0, {}]]]}, {"name": "res4b_branch2a", "config": {"name": "res4b_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 256, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_809", 0, 0, {}]]]}, {"name": "bn4b_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4b_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"name": "activation_810", "config": {"trainable": false, "name": "activation_810", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"name": "res4b_branch2b", "config": {"name": "res4b_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 256, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_810", 0, 0, {}]]]}, {"name": "bn4b_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4b_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"name": "activation_811", "config": {"trainable": false, "name": "activation_811", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"name": "res4b_branch2c", "config": {"name": "res4b_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 1024, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_811", 0, 0, {}]]]}, {"name": "bn4b_branch2c", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4b_branch2c", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"name": "add_265", "config": {"name": "add_265", "trainable": false}, "class_name": "Add", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_809", 0, 0, {}]]]}, {"name": "activation_812", "config": {"trainable": false, "name": "activation_812", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["add_265", 0, 0, {}]]]}, {"name": "res4c_branch2a", "config": {"name": "res4c_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "valid", "filters": 256, "activation": "linear", "kernel_size": [1, 1], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_812", 0, 0, {}]]]}, {"name": "bn4c_branch2a", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4c_branch2a", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"name": "activation_813", "config": {"trainable": false, "name": "activation_813", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"name": "res4c_branch2b", "config": {"name": "res4c_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "trainable": false, "padding": "same", "filters": 256, "activation": "linear", "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_813", 0, 0, {}]]]}, {"name": "bn4c_branch2b", "config": {"beta_constraint": null, "gamma_regularizer": null, "name": "bn4c_branch2b", "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": false, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"name": "activation_814", "config": {"trainable": false, "name": "activation_814", 