{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_3", "batch_input_shape": [null, 224, 224, 3], "sparse": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block1_pool", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 128, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 128, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block2_pool", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 256, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 256, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block3_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 256, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block3_pool", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block4_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 512, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block4_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 512, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block4_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 512, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block4_pool", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block5_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 512, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block5_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 512, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_regularizer": null, "padding": "same", "activation": "relu", "use_bias": true, "name": "block5_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 512, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": false}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": false, "data_format": "channels_last", "strides": [2, 2], "name": "block5_pool", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "batch_input_shape": [null, 7, 7, 512]}}, {"class_name": "Dense", "config": {"units": 256, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "name": "dense_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "activity_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "use_bias": true, "name": "dense_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null}}], "backend": "tensorflow"}