{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "same", "W_constraint": null, "b_constraint": null, "trainable": true, "nb_col": 5, "b_regularizer": null, "name": "cov1", "activity_regularizer": null, "batch_input_shape": [null, 200, 200, 3], "nb_row": 5, "init": "glorot_uniform", "activation": "relu", "subsample": [1, 1], "input_dtype": "float32", "dim_ordering": "tf", "nb_filter": 32, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [10, 10], "border_mode": "same", "name": "pool1", "trainable": true, "dim_ordering": "tf", "pool_size": [10, 10]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "same", "activation": "relu", "name": "cov3", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "nb_filter": 512, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [3, 3], "border_mode": "same", "name": "pool3", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "border_mode": "same", "activation": "relu", "name": "cov4", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "nb_col": 3, "dim_ordering": "tf", "nb_filter": 1024, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [3, 3], "border_mode": "same", "name": "pool4", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flat"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense2", "output_dim": 1, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "b_constraint": null, "input_dim": null, "W_constraint": null, "bias": true}}], "keras_version": "1.1.2"}