{"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_2", 0, 0]], "name": "model_1", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_2", "sparse": false}, "inbound_nodes": []}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"data_format": "channels_last", "name": "zero_padding2d_2", "trainable": false, "padding": [[3, 3], [3, 3]]}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"strides": [2, 2], "activation": "linear", "kernel_size": [7, 7], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv1", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"name": "bn_conv1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation_50", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_50", "trainable": false}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [3, 3], "trainable": false, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2"}, "inbound_nodes": [[["activation_50", 0, 0, {}]]]}, {"name": "res2a_branch2a", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2a_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_51", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_51", "trainable": false}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "res2a_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2a_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_51", 0, 0, {}]]]}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "activation_52", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_52", "trainable": false}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"name": "res2a_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2a_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_52", 0, 0, {}]]]}, {"name": "res2a_branch1", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2a_branch1", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add_17", "class_name": "Add", "config": {"name": "add_17", "trainable": false}, "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_53", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_53", "trainable": false}, "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"name": "res2b_branch2a", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2b_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_53", 0, 0, {}]]]}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"name": "activation_54", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_54", "trainable": false}, "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"name": "res2b_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2b_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_54", 0, 0, {}]]]}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"name": "activation_55", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_55", "trainable": false}, "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"name": "res2b_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2b_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_55", 0, 0, {}]]]}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"name": "add_18", "class_name": "Add", "config": {"name": "add_18", "trainable": false}, "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_53", 0, 0, {}]]]}, {"name": "activation_56", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_56", "trainable": false}, "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"name": "res2c_branch2a", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2c_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_56", 0, 0, {}]]]}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"name": "activation_57", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_57", "trainable": false}, "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"name": "res2c_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2c_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_57", 0, 0, {}]]]}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"name": "activation_58", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_58", "trainable": false}, "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"name": "res2c_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res2c_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_58", 0, 0, {}]]]}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"name": "add_19", "class_name": "Add", "config": {"name": "add_19", "trainable": false}, "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_56", 0, 0, {}]]]}, {"name": "activation_59", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_59", "trainable": false}, "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"name": "res3a_branch2a", "class_name": "Conv2D", "config": {"strides": [2, 2], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3a_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_59", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "activation_60", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_60", "trainable": false}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3a_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_60", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "activation_61", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_61", "trainable": false}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"name": "res3a_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3a_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_61", 0, 0, {}]]]}, {"name": "res3a_branch1", "class_name": "Conv2D", "config": {"strides": [2, 2], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3a_branch1", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_59", 0, 0, {}]]]}, {"name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_20", "class_name": "Add", "config": {"name": "add_20", "trainable": false}, "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "activation_62", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_62", "trainable": false}, "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"name": "res3b_branch2a", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3b_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_62", 0, 0, {}]]]}, {"name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"name": "activation_63", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_63", "trainable": false}, "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"name": "res3b_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3b_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_63", 0, 0, {}]]]}, {"name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"name": "activation_64", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_64", "trainable": false}, "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"name": "res3b_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3b_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_64", 0, 0, {}]]]}, {"name": "bn3b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"name": "add_21", "class_name": "Add", "config": {"name": "add_21", "trainable": false}, "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_62", 0, 0, {}]]]}, {"name": "activation_65", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_65", "trainable": false}, "inbound_nodes": [[["add_21", 0, 0, {}]]]}, {"name": "res3c_branch2a", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3c_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_65", 0, 0, {}]]]}, {"name": "bn3c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"name": "activation_66", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_66", "trainable": false}, "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"name": "res3c_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3c_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_66", 0, 0, {}]]]}, {"name": "bn3c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"name": "activation_67", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_67", "trainable": false}, "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"name": "res3c_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3c_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_67", 0, 0, {}]]]}, {"name": "bn3c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"name": "add_22", "class_name": "Add", "config": {"name": "add_22", "trainable": false}, "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_65", 0, 0, {}]]]}, {"name": "activation_68", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_68", "trainable": false}, "inbound_nodes": [[["add_22", 0, 0, {}]]]}, {"name": "res3d_branch2a", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3d_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_68", 0, 0, {}]]]}, {"name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"name": "activation_69", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_69", "trainable": false}, "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"name": "res3d_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3d_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_69", 0, 0, {}]]]}, {"name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"name": "activation_70", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_70", "trainable": false}, "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"name": "res3d_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res3d_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_70", 0, 0, {}]]]}, {"name": "bn3d_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"name": "add_23", "class_name": "Add", "config": {"name": "add_23", "trainable": false}, "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_68", 0, 0, {}]]]}, {"name": "activation_71", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_71", "trainable": false}, "inbound_nodes": [[["add_23", 0, 0, {}]]]}, {"name": "res4a_branch2a", "class_name": "Conv2D", "config": {"strides": [2, 2], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4a_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_71", 0, 0, {}]]]}, {"name": "bn4a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"name": "activation_72", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_72", "trainable": false}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"name": "res4a_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4a_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_72", 0, 0, {}]]]}, {"name": "bn4a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"name": "activation_73", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_73", "trainable": false}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"name": "res4a_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 1024, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4a_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_73", 0, 0, {}]]]}, {"name": "res4a_branch1", "class_name": "Conv2D", "config": {"strides": [2, 2], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 1024, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4a_branch1", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_71", 0, 0, {}]]]}, {"name": "bn4a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"name": "bn4a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"name": "add_24", "class_name": "Add", "config": {"name": "add_24", "trainable": false}, "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"name": "activation_74", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_74", "trainable": false}, "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"name": "res4b_branch2a", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4b_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_74", 0, 0, {}]]]}, {"name": "bn4b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"name": "activation_75", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_75", "trainable": false}, "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"name": "res4b_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4b_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_75", 0, 0, {}]]]}, {"name": "bn4b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]]}, {"name": "activation_76", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_76", "trainable": false}, "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]]}, {"name": "res4b_branch2c", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 1024, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4b_branch2c", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"name": "bn4b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2c", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]]}, {"name": "add_25", "class_name": "Add", "config": {"name": "add_25", "trainable": false}, "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_74", 0, 0, {}]]]}, {"name": "activation_77", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_77", "trainable": false}, "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"name": "res4c_branch2a", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [1, 1], "padding": "valid", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4c_branch2a", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_77", 0, 0, {}]]]}, {"name": "bn4c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4c_branch2a", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]]}, {"name": "activation_78", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_78", "trainable": false}, "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]]}, {"name": "res4c_branch2b", "class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "linear", "kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "res4c_branch2b", "dilation_rate": [1, 1], "bias_constraint": null}, "inbound_nodes": [[["activation_78", 0, 0, {}]]]}, {"name": "bn4c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4c_branch2b", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "trainable": false, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]]}, {"name": "activation_79", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_79", "trainable": false}, "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]]}, 