{"class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "block1_conv1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 64, "name": "block1_conv2", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": false, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "block2_conv1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 128, "name": "block2_conv2", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": false, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "block3_conv1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "block3_conv2", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 256, "name": "block3_conv3", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": false, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "block4_conv1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "block4_conv2", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "block4_conv3", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": false, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "block5_conv1", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "block5_conv2", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "filters": 512, "name": "block5_conv3", "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": false, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": false, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "batch_input_shape": [null, 7, 7, 512], "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 512, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 128, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "sigmoid"}}], "backend": "tensorflow"}