{"config": [{"config": {"use_bias": true, "filters": 16, "trainable": true, "name": "block1_cov1", "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "batch_input_shape": [null, 150, 150, 3], "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "block1_pool1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "filters": 32, "trainable": true, "name": "block2_cov1", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "block2_pool1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "filters": 64, "trainable": true, "name": "block3_cov1", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "block3_pool1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "filters": 128, "trainable": true, "name": "block4_cov1", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "filters": 128, "trainable": true, "name": "block4_cov2", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "name": "block4_pool", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "filters": 256, "trainable": true, "name": "block5_cov1", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "filters": 256, "trainable": true, "name": "block5_cov2", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "strides": [1, 1], "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_25"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flat"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "trainable": true, "units": 256, "name": "dense2", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_26"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "trainable": true, "units": 128, "name": "dense3", "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "trainable": true, "units": 1, "name": "dense4", "bias_constraint": null, "kernel_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential"}