{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "name": "block1_cov1", "init": "glorot_uniform", "nb_row": 3, "input_dtype": "float32", "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "border_mode": "same", "W_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 16, "bias": true, "b_constraint": null, "activation": "relu", "trainable": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "pool_size": [2, 2], "dim_ordering": "tf", "name": "block1_pool1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "name": "block2_cov1", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 32, "bias": true, "b_constraint": null, "activation": "relu", "trainable": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "pool_size": [2, 2], "dim_ordering": "tf", "name": "block2_pool1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "name": "block3_cov1", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 64, "bias": true, "b_constraint": null, "activation": "relu", "trainable": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "pool_size": [2, 2], "dim_ordering": "tf", "name": "block3_pool1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "name": "block4_cov1", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 128, "bias": true, "b_constraint": null, "activation": "relu", "trainable": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "pool_size": [2, 2], "dim_ordering": "tf", "name": "block4_pool", "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "name": "block5_cov1", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 128, "bias": true, "b_constraint": null, "activation": "relu", "trainable": true, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "name": "block5_cov2", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "nb_col": 3, "b_regularizer": null, "nb_filter": 128, "bias": true, "b_constraint": null, "activation": "relu", "trainable": true, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flat"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "name": "dense1", "activity_regularizer": null, "W_constraint": null, "output_dim": 256, "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "relu", "trainable": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "name": "dense2", "activity_regularizer": null, "W_constraint": null, "output_dim": 128, "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "relu", "trainable": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "name": "dense3", "activity_regularizer": null, "W_constraint": null, "output_dim": 1, "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "sigmoid", "trainable": true, "W_regularizer": null}}], "keras_version": "1.1.2"}