{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "border_mode": "same", "batch_input_shape": [null, 224, 224, 3], "nb_col": 3, "name": "block1_cov1", "b_constraint": null, "input_dtype": "float32", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 16, "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool1", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "name": "block2_cov1", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "nb_filter": 32, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool1", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "name": "block3_cov1", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool1", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "name": "block4_cov1", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "nb_filter": 128, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "name": "block5_cov1", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "nb_filter": 128, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "nb_col": 3, "name": "block5_cov2", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "nb_row": 3, "nb_filter": 128, "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flat", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "input_dim": null, "b_regularizer": null, "b_constraint": null, "name": "dense1", "output_dim": 256, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "input_dim": null, "b_regularizer": null, "b_constraint": null, "name": "dense2", "output_dim": 128, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "sigmoid", "input_dim": null, "b_regularizer": null, "b_constraint": null, "name": "dense3", "output_dim": 1, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true, "bias": true}}], "keras_version": "1.1.2"}