{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "filters": 16, "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "batch_input_shape": [null, 150, 150, 3], "strides": [1, 1], "data_format": "channels_last", "dtype": "float32", "dilation_rate": [1, 1], "name": "block1_cov1", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "name": "block1_pool1"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 32, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "name": "block2_cov1", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "name": "block2_pool1"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 64, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "name": "block3_cov1", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "name": "block3_pool1"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "name": "block4_cov1", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "name": "block4_pool"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "name": "block5_cov1", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "filters": 128, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "name": "block5_cov2", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flat"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 256, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense1", "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 128, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense2", "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense3", "kernel_constraint": null, "kernel_regularizer": null}}], "keras_version": "2.0.6"}