{"backend": "tensorflow", "config": [{"config": {"padding": "same", "bias_regularizer": null, "strides": [1, 1], "name": "block1_conv1", "batch_input_shape": [null, 224, 224, 3], "trainable": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 64, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block1_conv2", "filters": 64, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "block1_pool", "trainable": true, "padding": "same", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block2_conv1", "filters": 128, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block2_conv2", "filters": 128, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "block2_pool", "trainable": true, "padding": "same", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block3_conv1", "filters": 256, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block3_conv2", "filters": 256, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block3_conv3", "filters": 256, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "block3_pool", "trainable": true, "padding": "same", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block4_conv1", "filters": 512, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block4_conv2", "filters": 512, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block4_conv3", "filters": 512, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "block4_pool", "trainable": true, "padding": "same", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block5_conv1", "filters": 512, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block5_conv2", "filters": 512, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "name": "block5_conv3", "filters": 512, "trainable": true, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "block5_pool", "trainable": true, "padding": "same", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flat", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "name": "dense1", "trainable": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4096, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense2", "trainable": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "denseout1", "trainable": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "denseout2", "trainable": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "denseout3", "trainable": true, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6"}