{"keras_version": "2.0.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 64, "batch_input_shape": [null, 224, 224, 3], "trainable": true, "dtype": "float32", "padding": "same", "name": "block1_conv1", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 64, "trainable": true, "padding": "same", "name": "block1_conv2", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "same", "name": "block1_pool", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 128, "trainable": true, "padding": "same", "name": "block2_conv1", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 128, "trainable": true, "padding": "same", "name": "block2_conv2", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "same", "name": "block2_pool", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 256, "trainable": true, "padding": "same", "name": "block3_conv1", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 256, "trainable": true, "padding": "same", "name": "block3_conv2", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 256, "trainable": true, "padding": "same", "name": "block3_conv3", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "same", "name": "block3_pool", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 512, "trainable": true, "padding": "same", "name": "block4_conv1", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 512, "trainable": true, "padding": "same", "name": "block4_conv2", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 512, "trainable": true, "padding": "same", "name": "block4_conv3", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "same", "name": "block4_pool", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 512, "trainable": true, "padding": "same", "name": "block5_conv1", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 512, "trainable": true, "padding": "same", "name": "block5_conv2", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "filters": 512, "trainable": true, "padding": "same", "name": "block5_conv3", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "same", "name": "block5_pool", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flat", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "denseout1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "name": "denseout2"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "sigmoid", "bias_constraint": null, "name": "denseout3"}}]}