{"keras_version": "1.1.2", "config": [{"config": {"bias": true, "activity_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "border_mode": "same", "dim_ordering": "tf", "b_regularizer": null, "name": "block1_cov1", "nb_row": 3, "b_constraint": null, "input_dtype": "float32", "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "trainable": true, "activation": "relu", "nb_filter": 32, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "trainable": true, "name": "block1_cov2", "nb_filter": 32, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "block1_pool1", "strides": [3, 3], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 5, "trainable": true, "name": "block2_cov1", "nb_filter": 64, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 5, "trainable": true, "name": "block2_cov2", "nb_filter": 64, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "block2_pool1", "strides": [3, 3], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "trainable": true, "name": "block3_cov1", "nb_filter": 128, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "block3_pool", "strides": [3, 3], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "trainable": true, "name": "block4_cov1", "nb_filter": 512, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "block4_pool", "strides": [3, 3], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "trainable": true, "name": "block5_cov1", "nb_filter": 1024, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "block5_pool", "strides": [3, 3], "pool_size": [3, 3]}, "class_name": "MaxPooling2D"}, {"config": {"bias": true, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_row": 2, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 2, "trainable": true, "name": "block6_cov1", "nb_filter": 2048, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "border_mode": "same", "trainable": true, "name": "block6_pool", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flat"}, "class_name": "Flatten"}, {"config": {"bias": true, "output_dim": 64, "activity_regularizer": null, "input_dim": null, "name": "dense1", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "output_dim": 64, "activity_regularizer": null, "input_dim": null, "name": "dense2", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "relu", "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "output_dim": 1, "activity_regularizer": null, "input_dim": null, "name": "dense3", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "sigmoid", "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}