{"config": [{"config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_3", "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block1_conv1", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block1_conv2", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block1_pool", "trainable": false}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block2_conv1", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 128, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block2_conv2", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block2_pool", "trainable": false}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 256, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block3_conv1", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 256, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block3_conv2", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 256, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block3_conv3", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block3_pool", "trainable": false}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block4_conv1", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block4_conv2", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block4_conv3", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block4_pool", "trainable": false}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block5_conv1", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block5_conv2", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "bias_constraint": null, "padding": "same", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "filters": 512, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last", "trainable": false, "kernel_regularizer": null, "name": "block5_conv3", "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "block5_pool", "trainable": false}, "class_name": "MaxPooling2D"}, {"config": {"name": "global_average_pooling2d_3", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalAveragePooling2D"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_7", "trainable": true, "kernel_regularizer": null, "units": 1024, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_8", "trainable": true, "kernel_regularizer": null, "units": 512, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_9", "trainable": true, "kernel_regularizer": null, "units": 128, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_10", "trainable": true, "kernel_regularizer": null, "units": 1, "activation": "sigmoid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}