{"backend": "tensorflow", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activation": "relu", "padding": "same", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block1_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "kernel_size": [3, 3], "use_bias": true, "filters": 16, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "block1_pool1", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block2_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "filters": 32, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "block2_pool1", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block3_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "filters": 64, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "block3_pool1", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block4_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "filters": 128, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block4_cov2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "filters": 128, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "block4_pool", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block5_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "filters": 256, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "padding": "same", "trainable": true, "bias_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block5_cov2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "filters": 256, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_13", "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flat", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense1", "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_14", "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense2", "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_15", "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense3", "kernel_constraint": null, "trainable": true, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null}}], "class_name": "Sequential"}