{"config": [{"config": {"data_format": "channels_last", "name": "block1_cov1", "bias_constraint": null, "batch_input_shape": [null, 150, 150, 3], "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "dtype": "float32", "filters": 16}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "block1_pool1", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "block2_cov1", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "filters": 32}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "block2_pool1", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "block3_cov1", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "filters": 64}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "block3_pool1", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "block4_cov1", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "filters": 128}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "block4_pool", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "block5_cov1", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "filters": 128}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "name": "block5_cov2", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "filters": 128}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flat"}, "class_name": "Flatten"}, {"config": {"name": "dense1", "activation": "relu", "bias_constraint": null, "units": 256, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dense2", "activation": "relu", "bias_constraint": null, "units": 128, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dense3", "activation": "sigmoid", "bias_constraint": null, "units": 1, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential"}