{"keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "strides": [1, 1], "activation": "relu", "dtype": "float32", "kernel_regularizer": null, "filters": 16, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block1_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "padding": "same", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool1", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block2_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool1", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block3_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool1", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block4_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "strides": [2, 2], "pool_size": [2, 2], "padding": "same", "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block5_cov1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "filters": 128, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "block5_cov2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "padding": "same", "use_bias": true, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "rate": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flat", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 256, "name": "dense1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 128, "name": "dense2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 1, "name": "dense3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "trainable": true}}], "class_name": "Sequential", "backend": "tensorflow"}